import "./styles.css";
import { createGameOfLife } from "./createGameOfLife";
createGameOfLife(document.querySelector("#app")); // - правила с логикой
// - интерфейс
// - интерфейс поля
// - обработчики событий (менять состояние клетки при нажатии)
// - автоматический пересчет состояний
// /**
//  *    0 1 0 0 1 0 1
//  *    0 1 0 0 1 0 0
//  *    0 1 0 0 1 1 1
//  */
//  // y - 0, 1, 2
//  // x - 0-6
//  // (x, y)
//  // (1, 2) -> 1
//  // (5, 1) -> 0
//  // (5, 2) -> 1
//  // (6, 0) -> 1
// const field = [
//   [0, 1, 0, 0, 1, 0, 1],
//   [0, 1, 0, 0, 1, 0, 0],
//   [0, 1, 0, 0, 1, 1, 1]
// ];
// const x = 4;
// const y = 1;
// field[y][x]